
#Область СлужебныеПроцедурыИФункции

//{{Доработка Добавление дополнительных реквизитов, группы и команд на форму документов 17.09.23г.

Процедура ДополнитьФорму(Форма) Экспорт
			
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
	ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма);
	ДобавитьГруппуСкидка(Форма);
	ДобавитьРеквизитФормыСогласованнаяСкидка(Форма);
	ДобавитьКомандуФормыПересчитатьТаблицу(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
	ВставитьРеквизитКонтактноеЛицоВФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	ВставитьРеквизитКонтактноеЛицоВФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
	ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
	ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма)
	
	//Добавление реквизита формы "КонтактноеЛицо" под реквизитом "Договор"		
	ЭлементКонтактноеЛицо = Форма.Элементы.Добавить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Дораб_КонтактныеЛица");
	
КонецПроцедуры

Процедура ВставитьРеквизитКонтактноеЛицоВФормуПередСуммаДокумента(Форма)
	
	//Добавление реквизита формы "КонтактноеЛицо" перед реквизитом "СуммаДокумента"	
	ЭлементКонтактноеЛицо = Форма.Элементы.Вставить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Дораб_КонтактныеЛица");
	
КонецПроцедуры

Процедура ДобавитьГруппуСкидка(Форма)
	
	//Добавление группы "Скидка" на форму документа
	Группа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
КонецПроцедуры

Процедура ДобавитьРеквизитФормыСогласованнаяСкидка(Форма)	

	//Добавление реквизита формы "СогласованнаяСкидка"
	ЭлементСогласованнаяСкидка = Форма.Элементы.Добавить("ЭлементСогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.Дораб_СогласованнаяСкидка";
	ЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "Дораб_СогласованнаяСкидкаПриИзменении");	

КонецПроцедуры

Процедура ДобавитьКомандуФормыПересчитатьТаблицу(Форма)
	
	//Добавление команды формы "ПересчитатьТаблицу"	
	Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "Дораб_ПересчитатьТаблицу";
	
	КомандаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
	КомандаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КомандаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	
КонецПроцедуры 

//Конец доработки дополнительных реквизитов, группы и команд на форму документов 17.09.23г.}}

#КонецОбласти

