
#Область СлужебныеПроцедурыИФункции

//{{Доработка Добавление Реквизита КонтактноеЛицо на форму документов 17.09.23г.

Процедура ДополнитьФорму(Форма) Экспорт
			
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
	ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
	ВставитьРеквизитКонтактноеЛицоВФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	ВставитьРеквизитКонтактноеЛицоВФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
	ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
	ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРеквизитКонтактноеЛицоВШапкуФормыПраво(Форма)
	
	//Добавление реквизита формы "КонтактноеЛицо" под реквизитом "Договор"		
	ЭлементКонтактноеЛицо = Форма.Элементы.Добавить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Дораб_КонтактныеЛица");
	
КонецПроцедуры

Процедура ВставитьРеквизитКонтактноеЛицоВФормуПередСуммаДокумента(Форма)
	
	//Добавление реквизита формы "КонтактноеЛицо" перед реквизитом "СуммаДокумента"	
	ЭлементКонтактноеЛицо = Форма.Элементы.Вставить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Дораб_КонтактноеЛицо";
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Дораб_КонтактныеЛица");
	
КонецПроцедуры
//Конец Доработки Добавление Реквизита КонтактноеЛицо на форму документов}}

#КонецОбласти

